scripts/test-validar-from-MDPHP-55087010-0691.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="https://factura-agt.vercel.app/facturacao/v1">
  <soapenv:Header/>
  <soapenv:Body>
    <tns:ValidarDocumentoRequest>
      <schemaVersion>1.0</schemaVersion>
      <submissionId>MDPHP-55087010-0691</submissionId>
      <taxRegistrationNumber>987654321</taxRegistrationNumber>
      <emitterTaxRegistrationNumber>123456789</emitterTaxRegistrationNumber>
      <submissionTimeStamp>2025-12-27T02:12:40+01:00</submissionTimeStamp>
      <softwareInfo>
        <softwareInfoDetail>
          <productId>TEST_SOFT</productId>
          <productVersion>1.0</productVersion>
          <softwareValidationNumber>VAL-TEST</softwareValidationNumber>
        </softwareInfoDetail>
        <jwsSoftwareSignature>PLACEHOLDER</jwsSoftwareSignature>
      </softwareInfo>
      <jwsSignature>PLACEHOLDER_JWS</jwsSignature>
      <documentNo>FT2025-VALIDAR-002</documentNo>
      <action>C</action>
    </tns:ValidarDocumentoRequest>
  </soapenv:Body>
</soapenv:Envelope>